Revit 2027 API
PlasticvinylPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylPattern" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlasticvinylPatternType
Public Enumeration PlasticvinylPatternType
public enum class PlasticvinylPatternType
type PlasticvinylPatternType
Members
Member name | Value | Description
Custom | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace